# Задайте последовательность чисел. Напишите программу, которая выведет 
# список неповторяющихся элементов исходной последовательности

list1 = [1, 2, 3, 4, 3, 2] 
list2 = list(set(list1)) 
print(list2)
